Input:
neo4j-sh (?)$ MATCH (user:User{email:"mahesh.lal@gmail.com"})-[:MADE_BOOKING]->(b:Booking) RETURN b._id as booking_id;

Output:
+----------------------------------------+
| booking_id                             |
+----------------------------------------+
| "ff3dd694-7e7f-11e4-bb93-14109fda6b71" |
| "7c63cc35-7e7f-11e4-8ffe-14109fda6b71" |
| "f5f15252-1b62-11e5-8252-6c40089a9424" |
| "d45de0c2-1b62-11e5-98a2-6c40089a9424" |
| "af041ab0-7e2f-11e4-adac-14109fda6b71" |
| "fef04c30-7e2d-11e4-8842-14109fda6b71" |
| "f87a515e-7e2d-11e4-b170-14109fda6b71" |
| "75b3e78c-7e2b-11e4-a162-14109fda6b71" |
| "251679be-1b3f-11e5-820e-6c40089a9424" |
+----------------------------------------+
9 rows
