Input:
neo4j-sh (?)$ MATCH (c1:City{name:"Athens"}), (c2:City{name:"Mumbai"}) RETURN c1, c2;

Output:
+----------------------------------------------------------------------------------+
| c1                                      | c2                                     |
+----------------------------------------------------------------------------------+
| Node[7]{name:"Athens",country:"Greece"} | Node[9]{name:"Mumbai",country:"India"} |
+----------------------------------------------------------------------------------+
1 row
