Input:
neo4j-sh (?)$ MATCH (city:City{name:"New York"}) RETURN city;

Output:
+-------------------------------------------------------------+
| city                                                        |
+-------------------------------------------------------------+
| Node[1]{country:"United States of America",name:"New York"} |
+-------------------------------------------------------------+
1 row
